#+TITLE: Testing Kubernetes with kind and kubetest
#+AUTHOR: Stephen Heywood
#+EMAIL: stephen@ii.coop
#+CREATOR: ii.coop
#+DATE:  1st May, 2019
#+STARTUP: showeverything

* Update the current session

We just installed a number of components, so we need the current shell session to be in sync with the new environment variables.

Ensure go is in your path and your happy with the default/detected GO variables.

#+BEGIN_SRC shell
go env
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
GOARCH="amd64"
GOBIN=""
GOCACHE="/home/hippie/.cache/go-build"
GOEXE=""
GOFLAGS=""
GOHOSTARCH="amd64"
GOHOSTOS="linux"
GOOS="linux"
GOPATH="/home/hippie/go"
GOPROXY=""
GORACE=""
GOROOT="/usr/local/go"
GOTMPDIR=""
GOTOOLDIR="/usr/local/go/pkg/tool/linux_amd64"
GCCGO="gccgo"
CC="gcc"
CXX="g++"
CGO_ENABLED="1"
GOMOD=""
CGO_CFLAGS="-g -O2"
CGO_CPPFLAGS=""
CGO_CXXFLAGS="-g -O2"
CGO_FFLAGS="-g -O2"
CGO_LDFLAGS="-g -O2"
PKG_CONFIG="pkg-config"
GOGCCFLAGS="-fPIC -m64 -pthread -fmessage-length=0 -fdebug-prefix-map=/tmp/go-build423342456=/tmp/go-build -gno-record-gcc-switches"
#+END_EXAMPLE


They may or may not be present in your environment.

#+BEGIN_SRC tmate
. ~/.bashrc
env | grep GO
#+END_SRC

This could provide a result as below.

#+BEGIN_EXAMPLE
GOPATH=/root/go
GOROOT=/usr/local/go/
#+END_EXAMPLE


